trade_exp/src/Documents/ПриемкаСдачаВыполненныхРаботУслуг/ПриемкаСдачаВыполненныхРаботУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9b7637e6-ce8c-4067-a7ab-aebee7fb6068">
  <name>ПриемкаСдачаВыполненныхРаботУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="640075d1-a883-4c59-80f6-31455d14d3e4">
    <name>Заказчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c8e1639f-b53e-4a57-a69d-df84fb1c3396">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="be9259cc-6103-496f-b8da-c2eaae517f04">
    <name>КоличествоВыданныхПарПерчаток</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a815d23c-6101-4320-825f-c5d68475b788">
    <name>Подрядчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ed5f409f-4846-44eb-a9f4-914ca9bd7fa5">
    <name>ВыполненныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2daf44ca-f6c9-4c0a-b088-30fe5c7042a0">
    <name>ОтправленоЭП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a4811f6e-5f29-4eed-9385-a3228fb84314">
    <name>НомерАкта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a09a2e36-26bb-40d4-8abd-3fc7f0c422cd">
    <name>ПланСотрудники</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d7535430-f6c8-449f-85ef-104dd350e722">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7396208-385c-44b3-9e3e-8ccfa1c8a787">
    <name>Клининг</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="9cd10099-ed23-4d2c-8d9a-e50b648b9689">
    <name>Работы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c65163bf-7640-4259-b94a-ab619bda8de8">
      <name>ФИОРаботника</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="155b467d-4312-4d30-aa15-b97581ea6489">
      <name>ВидРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4c4b195d-a7b1-4a77-a8ff-90fbe2212df9">
      <name>ДатаИВремяНачалаРабот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="82b83517-8cd6-4f21-8ab5-f0663cee7bf8">
      <name>ДатаИВремяОкончанияРабот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d748c77f-4708-4cbe-b920-f0768ef4f4bb">
      <name>ВремяФакт</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>4</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8ba97333-0eeb-400e-8a1e-fb654d8dd31f">
      <name>Тариф</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="326208a3-3feb-44b6-b643-bce0dff7d121">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="022dd625-7a4a-43b0-b5ba-60f92e90f97b">
      <name>КомментарийККачествуВыполненияРабот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d707e412-8c2b-42a5-8b58-02f355325460">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="09a7ae30-c9ad-449f-a5b4-48324c8c81c7">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="387ddfc6-b06b-46b8-8b0a-344bb038777f">
      <name>ОплатаПодрядчику</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>12</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="920d3dfb-a4ed-471e-8227-326fddde53ae">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="35c83be2-866b-431b-abf2-4386792699b4">
      <name>Банк</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>120</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4795be15-525d-4650-9923-ef841e2026f3">
      <name>ДатаРабот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b6ce7b63-cc17-4f8b-bc12-d769e73575bb">
      <name>КлинингПлощадь</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d86a4e2c-0ca3-425f-890a-25eeb78fb619">
      <name>КлинингВыполненныеРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>255</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="dae401cc-8b1f-4bb3-a37c-45d743269dc9">
      <name>КлинингОценкаКачества</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1623805c-3e9f-40ab-855c-145ccf50a77c">
      <name>КлинингТариф</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>255</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/УчетРабочегоВремениСотрудников/УчетРабочегоВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="13d75dc0-9223-4b1b-beb4-cba8132abe50">
  <name>УчетРабочегоВремениСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="a44913b0-4063-4968-bf34-b77f64254b83">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="54b7c3ee-5669-4057-b209-a361d67c8bad">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0d926621-4d7d-40ed-8fec-80d57c83437a">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="58649832-c538-4ecf-98e0-7df52cfc2105">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СостоянияСотрудников/СостоянияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5c9d146-8f4a-45db-9b47-dc1f6c9559b2">
  <name>СостоянияСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b343c276-8ae6-43f0-b8dc-6404f67693a2">
    <name>Зашел</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="33217620-5c33-4012-bc80-e5f910792d19">
    <name>Вышел</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ДаНет/ДаНет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b5d51784-420f-4626-af4c-f7d836caf57f">
  <name>ДаНет</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="1c99336f-3de7-4530-9bda-002d699a684b">
    <name>Да</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e2f6e8f2-6e73-4e7c-9bef-3d7b3189d897">
    <name>Нет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/СотрудникиАутсорс/СотрудникиАутсорс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="84522b4b-02c5-4b70-b10f-f972972fb4c6">
  <name>СотрудникиАутсорс</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6f35cbbf-f5a3-459a-a607-633d1c8e0857">
    <name>НомерТелефона</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="38fe249e-3835-4d73-a86a-1f21ace23d26">
    <name>Банк</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a83ea452-7ac0-4107-b54b-f9c4e6d9e5d7">
    <name>НомерКарты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>19</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f7af57c6-f7c7-44ea-a409-a28230b64997">
    <name>ФИОПолучателя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/ГруппыДоступа/ГруппыДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d0106f3a-8490-4277-a278-75c318ec252c">
  <name>ГруппыДоступа</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="0132e564-2cd3-4930-8962-1068532f4be4">
    <name>Пользователи</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="57d0f9b0-18d0-48ba-9f3c-d106f66ac602">
      <name>Пользователь</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Documents/ПриемкаСдачаВыполненныхРаботУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПартнерыТЧВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Объект.Подрядчик = Элемент.ТекущиеДанные.Партнер;
	Элементы.ГруппаШапка.Видимость = Истина;
	Элементы.ВкладкаРаботы.Видимость = Истина;
	Элементы.ПартнерыТСД.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПартнерыТЧПартнерОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Объект.Подрядчик = ВыбранноеЗначение;
	Элементы.ГруппаШапка.Видимость = Истина;
	Элементы.ВкладкаРаботы.Видимость = Истина;
	Элементы.ПартнерыТСД.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПодрядчикНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	#Если НЕ МобильноеПриложениеКлиент И НЕ МобильныйКлиент Тогда
		СтандартнаяОбработка = Ложь;
		СвойМассивЗначений = ОтборПартнера();
		ПараметрыОтбора = Новый Структура("Ссылка", СвойМассивЗначений);
		ПараметрыОткрытия = Новый Структура("Отбор", ПараметрыОтбора); 
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора", ПараметрыОткрытия,Элемент, ЭтаФорма);
	#КонецЕсли
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		СтандартнаяОбработка = Ложь;
		Элементы.ГруппаШапка.Видимость = Ложь;
		Элементы.ВкладкаРаботы.Видимость = Ложь;
		Элементы.ПартнерыТСД.Видимость = Истина;
	#КонецЕсли
КонецПроцедуры
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивПартнеров = ОтборПартнера();
	ПартнерыТЧ.Очистить();
	Для Каждого Партнер из МассивПартнеров Цикл
		НоваяСтрока = ПартнерыТЧ.Добавить();
		НоваяСтрока.Партнер = Партнер;
	КонецЦикла;
	ВидимостьЭлементовФормы();
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Организация = АльтерраОбщегоНазначения.ПолучитьАльтерра();
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьЭлементовФормы()
	Элементы.Отправить1.Видимость = Ложь;
	Элементы.ОтправленоЭП1.видимость = Ложь;
	Если НЕ АльтерраОбщегоНазначения._РольДоступна("ПолныеПрава") И НЕ АльтерраОбщегоНазначения._РольДоступна("СлужбаПерсонала") И НЕ АльтерраОбщегоНазначения._РольДоступна("ПриемкаСдачаВыполненыхРаботТарифы") Тогда
		Элементы.РаботыОплатаПодрядчику.Видимость = Ложь;
		Элементы.РаботыЦена.Видимость = Ложь;	
		Элементы.РаботыСумма.Видимость = Ложь;
		Элементы.ГруппаРассылка.Видимость = Ложь;
		Элементы.Отправить1.Видимость = Истина;
		Элементы.ОтправленоЭП1.видимость = Истина;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовТСД() 
	
	Элементы.НомерДокументаАкта.Видимость = Ложь;	
	Элементы.ГруппаРассылка.Видимость = Ложь;
	Элементы.Подрядчик.РедактированиеТекста = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РаботыДатаРаботПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаИВремяОкончанияРабот) И ЗначениеЗаполнено(ТекущаяСтрока.ДатаИВремяНачалаРабот) Тогда
		ТекущаяСтрока.ВремяФакт = (ТекущаяСтрока.ДатаИВремяОкончанияРабот - ТекущаяСтрока.ДатаИВремяНачалаРабот)/3600;
		ПересчитатьСумму();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура РаботыФИОРаботникаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	ДанныеБанка = ОпределениеДанныхБанка(ТекущиеДанные.ФИОРаботника);
	Если ДанныеБанка.Количество() <> 0 Тогда
		Для Каждого Строка из ДанныеБанка Цикл
			Если Строка.Ключ = "НомерТелефона" Тогда
				ТекущиеДанные.НомерТелефона = Строка.Значение;
			ИначеЕсли Строка.Ключ = "БанкНаименование" Тогда
				ТекущиеДанные.Банк = Строка.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ОпределениеДанныхБанка(Работник)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СотрудникиАутсорс.НомерТелефона КАК НомерТелефона,
	|	СотрудникиАутсорс.Банк КАК БанкНаименование
	|ИЗ
	|	Справочник.СотрудникиАутсорс КАК СотрудникиАутсорс
	|ГДЕ
	|	СотрудникиАутсорс.Ссылка = &Работник";
	Запрос.УстановитьПараметр("Работник", Работник);
	Выборка = Запрос.Выполнить().Выбрать();
	Структура = Новый Структура;
	Пока Выборка.Следующий() Цикл
		Структура.Вставить("НомерТелефона", Выборка.НомерТелефона);	
		Структура.Вставить("БанкНаименование", Выборка.БанкНаименование );
	КонецЦикла;
	Возврат Структура;
КонецФункции
&НаКлиенте
Процедура Очистить(Команда)
	Если АльтерраОбщегоНазначения._РольДоступна("ПолныеПрава") ИЛИ АльтерраОбщегоНазначения._РольДоступна("СлужбаПерсонала") Тогда
		Объект.НомерАкта = 0;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не достаточно прав для очистки номера акта");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура РаботыВидРаботНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	Элемент.СписокВыбора.Очистить();
	СвойМассивЗначений = ОтборНоменклатурыПартнера(Объект.Подрядчик);
	Элемент.СписокВыбора.ЗагрузитьЗначения(СвойМассивЗначений);
	Партнер = ПартнерНаСервере();
	ПараметрыОтбора = Новый Структура("ВладелецНоменклатуры", Партнер);
	ПараметрыОткрытия = Новый Структура("Отбор", ПараметрыОтбора); 
	ОткрытьФорму("Справочник.НоменклатураКонтрАгентов.ФормаВыбора", ПараметрыОткрытия, Элемент, ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ПартнерНаСервере()
	Возврат Объект.Подрядчик.Партнер;
КонецФункции

&НаСервере
Функция ОтборПартнера()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Партнер
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ДополнительныеСведения.Объект = Контрагенты.Партнер)
	|ГДЕ
	|	ДополнительныеСведения.Свойство.Наименование ПОДОБНО  ""%ПроцентАутсорс%""
	|	И ДополнительныеСведения.Значение > 0";
	Выборка = Запрос.Выполнить().Выбрать();
	МассивПартнеров = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивПартнеров.Добавить(Выборка.Партнер);
	КонецЦикла;
	Возврат МассивПартнеров;
КонецФункции

&НаСервере
Функция ОтборНоменклатурыПартнера(Подрядчик)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НоменклатураКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (НоменклатураКонтрагентов.ВладелецНоменклатуры = Контрагенты.Партнер)
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент", Подрядчик);
	Выборка = запрос.Выполнить().Выбрать();
	Массив = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Возврат Массив;
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОчиститьДанныеРегистра();
	УчетРабочегоВременАутсорс(); 
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Клининг.Доступность = Ложь; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Клининг = Ложь Тогда
		Если Не ЗначениеЗаполнено(Объект.Заказчик) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле Заказчик");
			Отказ = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле Подразделение");
			Отказ = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.Подрядчик) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле Подрядчик");
			Отказ = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ВыполненныеРаботы) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле Выполненные Работы");
			Отказ = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ПланСотрудники) или Объект.ПланСотрудники = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле Количество план");
				Отказ = Истина;		
		КонецЕсли;	
		Для Каждого Строка из Объект.Работы Цикл
			НомерСтрока = Строка.НомерСтроки;
			Если ЭтоСотрудник Тогда
				Если НЕ ЗначениеЗаполнено(Строка.Сотрудник) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле Сотрудник в строке " + НомерСтрока);
					Отказ = Истина;
				КонецЕсли;
			Иначе
				Если НЕ ЗначениеЗаполнено(Строка.ФИОРаботника) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле ФИО работника в строке " + НомерСтрока);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Строка.ВидРабот) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле Вид работ в строке " + НомерСтрока);
				Отказ = Истина;
			КонецЕсли;
			Если Строка.ДатаИВремяНачалаРабот = Дата('00010101') Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле Дата начало работ в строке " + НомерСтрока);
				Отказ = Истина;		
			КонецЕсли;
			Если Строка.ДатаИВремяОкончанияРабот = Дата('00010101') Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле Дата окончания работ в строке " + НомерСтрока);
				Отказ = Истина;	
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если Объект.Работы.Количество() > 0 Тогда
			 Для Каждого Строка из Объект.Работы Цикл
				НомерСтрока = Строка.НомерСтроки;
				Если НЕ ЗначениеЗаполнено(Строка.ВидРабот) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле Вид работ в строке " + НомерСтрока);
						Отказ = Истина;
				КонецЕсли;
				Если Строка.ДатаРабот = Дата('00010101') Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле Дата работ в строке " + НомерСтрока);
					Отказ = Истина;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Строка.КлинингПлощадь) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле Площадь в строке " + НомерСтрока);
					Отказ = Истина;		
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Строка.КлинингВыполненныеРаботы) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле Выполненные работы работ в строке " + НомерСтрока);
					Отказ = Истина;	
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Строка.КлинингОценкаКачества) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле Оценка качества работ работ в строке " + НомерСтрока);
					Отказ = Истина;	
				КонецЕсли;
			КонецЦикла;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан ни один вид работ");
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ОчиститьДанныеРегистра()
	Документ = Объект.Ссылка.ПолучитьОбъект();
	ТабРаботы = Документ.Работы.Выгрузить();
	СотрудникЗаказчик = АльтерраОбщегоНазначения.ПолучитьСотрудника(Документ.Заказчик);
	СотрудникАутсорс = НайтиСотрудникаАутсорса(СотрудникЗаказчик.Отдел);
	n = 0;
	ДатаНачало = Неопределено;
	ДатаОкончания = Неопределено;
	ПустаяДата = '00010101';
	Для Каждого Строка из ТабРаботы Цикл
		ВремяНачало = Строка.ДатаИВремяНачалаРабот - ПустаяДата;
		ВремяОкончания = Строка.ДатаИВремяОкончанияРабот - ПустаяДата; 
		Если n = 0  Тогда
			ДатаНачало = Строка.ДатаРабот + ВремяНачало;
			ДатаОкончания = Строка.ДатаРабот + ВремяОкончания;
		КонецЕсли;
		Если ДатаНачало > Строка.ДатаРабот + ВремяНачало Тогда
			ДатаНачало = Строка.ДатаРабот + ВремяНачало;
		КонецЕсли; 
		Если ДатаОкончания < Строка.ДатаРабот + ВремяОкончания Тогда
			ДатаОкончания = Строка.ДатаРабот + ВремяОкончания;
		КонецЕсли;
		n = n + 1;
	КонецЦикла;
	Если СотрудникАутсорс <> Неопределено ИЛИ ДатаНачало <> Неопределено ИЛИ Документ.Подразделение <> Неопределено Тогда
		ОчиститьРегистр(СотрудникАутсорс,ДатаНачало,Документ.Подразделение, Документ.Заказчик);
		ОчиститьРегистр(СотрудникАутсорс,ДатаОкончания,Документ.Подразделение, Документ.Заказчик);
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ОчиститьРегистр(СотрудникАутсорс,Дата,Подразделение, Пользователь)
	НаборЗаписей= РегистрыСведений.УчетРабочегоВремениСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Установить(СотрудникАутсорс);
	Если СотрудникАутсорс <> Неопределено Тогда
		Подразделение = ?(ЗначениеЗаполнено(СотрудникАутсорс.Подразделение), СотрудникАутсорс.Подразделение, Подразделение);
	КонецЕсли;
	НаборЗаписей.Отбор.Подразделение.Установить(Подразделение);
	Пользователь = ?(СотрудникАутсорс <> Неопределено, СотрудникАутсорс.Пользователь, Пользователь);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Период.Установить(Дата);
	НаборЗаписей.Записать();
КонецПроцедуры
&НаСервере
Процедура УчетРабочегоВременАутсорс()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ПриемкаСдачаВыполненныхРаботУслугРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ""Сотрудник""
	|		ИНАЧЕ ""Работник""
	|	КОНЕЦ КАК СотрудникРаботник,
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.ДатаИВремяНачалаРабот КАК ДатаИВремяНачалаРабот,
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.ДатаИВремяОкончанияРабот КАК ДатаИВремяОкончанияРабот,
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.ДатаРабот КАК ДатаРабот,
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.Сотрудник КАК Сотрудник,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Заказчик КАК Заказчик,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Документ.ПриемкаСдачаВыполненныхРаботУслуг.Работы КАК ПриемкаСдачаВыполненныхРаботУслугРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемкаСдачаВыполненныхРаботУслуг КАК ПриемкаСдачаВыполненныхРаботУслуг
	|		ПО (ПриемкаСдачаВыполненныхРаботУслугРаботы.Ссылка = ПриемкаСдачаВыполненныхРаботУслуг.Ссылка)
	|ГДЕ
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.Ссылка = &Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.ДатаИВремяНачалаРабот КАК ДатаИВремяНачалаРабот,
	|	ВременнаяТаблица.ДатаИВремяОкончанияРабот КАК ДатаИВремяОкончанияРабот,
	|	ВременнаяТаблица.ДатаРабот КАК ДатаРабот,
	|	ВременнаяТаблица.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблица.Подразделение КАК Подразделение
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|ГДЕ
	|	ВременнаяТаблица.СотрудникРаботник = ""Сотрудник""
	|ИТОГИ
	|	МИНИМУМ(ДатаИВремяНачалаРабот),
	|	МАКСИМУМ(ДатаИВремяОкончанияРабот)
	|ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.ДатаИВремяНачалаРабот КАК ДатаИВремяНачалаРабот,
	|	ВременнаяТаблица.ДатаИВремяОкончанияРабот КАК ДатаИВремяОкончанияРабот,
	|	ВременнаяТаблица.ДатаРабот КАК ДатаРабот,
	|	ВременнаяТаблица.Заказчик КАК Заказчик,
	|	ВременнаяТаблица.Подразделение КАК Подразделение
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|ГДЕ
	|	ВременнаяТаблица.СотрудникРаботник = ""Работник""
	|ИТОГИ
	|	МИНИМУМ(ДатаИВремяНачалаРабот),
	|	МАКСИМУМ(ДатаИВремяОкончанияРабот),
	|	МАКСИМУМ(ДатаРабот)
	|ПО
	|	Заказчик";

	Запрос.УстановитьПараметр("Документ", Объект.ссылка);
	Результат = Запрос.ВыполнитьПакет();
	СотрудникЗаказчик = АльтерраОбщегоНазначения.ПолучитьСотрудника(Объект.Заказчик);
	СотрудникАутсорс = НайтиСотрудникаАутсорса(СотрудникЗаказчик.Отдел);
	Если СотрудникАутсорс = Неопределено Тогда
		Сообщить("Аутсорс с отделом " + СотрудникЗаказчик.Отдел + " не найден");
		Возврат;
	КонецЕсли;
	ВыборкаСотрудников = Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сотрудник");
	Пока ВыборкаСотрудников.Следующий() Цикл
		ЗаписьВРегистрУчетаРабочегоВремени(ВыборкаСотрудников.Сотрудник, ВыборкаСотрудников.ДатаРабот, ВыборкаСотрудников.ДатаИВремяНачалаРабот, Перечисления.СостоянияСотрудников.Зашел, ВыборкаСотрудников.Подразделение,ВыборкаСотрудников.Заказчик);
		ЗаписьВРегистрУчетаРабочегоВремени(ВыборкаСотрудников.Сотрудник, ВыборкаСотрудников.ДатаРабот, ВыборкаСотрудников.ДатаИВремяОкончанияРабот , Перечисления.СостоянияСотрудников.Вышел, ВыборкаСотрудников.Подразделение,ВыборкаСотрудников.Заказчик);	
	КонецЦикла;
	
	ВыборкаРаботников = Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Заказчик");
	Пока ВыборкаРаботников.Следующий() Цикл
		Если СотрудникЗаказчик = Неопределено Тогда
			Сообщить("У заказчика не заполнен Пользователь в справочнике Сотрудники");
			Возврат;
		КонецЕсли;
		Если СотрудникАутсорс <> Неопределено ИЛИ ВыборкаРаботников.ДатаИВремяНачалаРабот <> Неопределено Тогда
		ЗаписьВРегистрУчетаРабочегоВремени(СотрудникАутсорс, ВыборкаРаботников.ДатаРабот, ВыборкаРаботников.ДатаИВремяНачалаРабот, Перечисления.СостоянияСотрудников.Зашел, ВыборкаРаботников.Подразделение, ВыборкаРаботников.Заказчик);
		ЗаписьВРегистрУчетаРабочегоВремени(СотрудникАутсорс, ВыборкаРаботников.ДатаРабот, ВыборкаРаботников.ДатаИВремяОкончанияРабот , Перечисления.СостоянияСотрудников.Вышел, ВыборкаРаботников.Подразделение, ВыборкаРаботников.Заказчик);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
&НаСервере
Функция НайтиСотрудникаАутсорса(Отдел)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Аутсорс = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|	И Сотрудники.Отдел = &Отдел";
	Запрос.УстановитьПараметр("Отдел",Отдел);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Сотрудник;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции
&НаСервере
Процедура ЗаписьВРегистрУчетаРабочегоВремени(Сотрудник, ДатаРабот, Переод, Сострояние, Подразделение, Пользователь)
	ПустаяДата = '00010101';
	Время = Переод - ПустаяДата;
	ПереодЗаписи = ДатаРабот + Время; 
	НаборЗаписей= РегистрыСведений.УчетРабочегоВремениСотрудников.СоздатьНаборЗаписей();
	НоваяЗапись= НаборЗаписей.Добавить();
	НоваяЗапись.Период= ПереодЗаписи;
	НоваяЗапись.Сотрудник= Сотрудник;
	НоваяЗапись.Пользователь= ?(ЗначениеЗаполнено(Сотрудник.Пользователь), Сотрудник.Пользователь, Пользователь);
	НоваяЗапись.Событие= Сострояние;
	НоваяЗапись.Подразделение= ?(ЗначениеЗаполнено(Сотрудник.Подразделение), Сотрудник.Подразделение, Подразделение);
	НаборЗаписей.Записать(Ложь);
КонецПроцедуры
&НаКлиенте
Процедура ЭтоСотрудникПриИзменении(Элемент)
	//Если ЭтоСотрудник Тогда
	//	Элементы.РаботыСотрудник.Видимость = Истина;
	//	Элементы.РаботыФИОРаботника.Видимость = Ложь;
	//	Элементы.РаботыБанк.Видимость = Ложь;
	//	Элементы.РаботыНомерТелефона.Видимость = Ложь;
	//	Для каждого Строка из Объект.Работы Цикл
	//		Строка.ФИОРаботника = "";
	//		Строка.Банк = Неопределено;
	//		Строка.НомерТелефона = Неопределено
	//	КонецЦикла;
	//Иначе
	//	Элементы.РаботыСотрудник.Видимость = Ложь;
	//	Элементы.РаботыФИОРаботника.Видимость = Истина;
	//	Элементы.РаботыБанк.Видимость = Истина;
	//	Элементы.РаботыНомерТелефона.Видимость = Истина;
	//	Для каждого Строка из Объект.Работы Цикл
	//		Строка.Сотрудник = ОчиститьРеквизитСотрудник();
	//	КонецЦикла;
	//КонецЕсли
КонецПроцедуры

Функция ОчиститьРеквизитСотрудник()
	Возврат ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка")
КонецФункции
&НаКлиенте
Процедура Отправить(Команда)
	ПисьмоОтправлено = ОтправитьПисьмоНаСервере();
	Если ПисьмоОтправлено Тогда 
		Сообщить("Письмо отправлено");
	КонецЕсли;
	Объект.ОтправленоЭП = Истина;
	Элементы.Отправить1.Доступность = Ложь;
	Элементы.Отправить.Доступность = Ложь;
	ЭтаФорма.Записать();
КонецПроцедуры




&НаСервере
Функция ЗаблокироватьРедактирование()
	Если СотрудникИзСлужбыПерсонала() Тогда
		ЭтотОбъект.ТолькоПросмотр = Ложь;
	Иначе
		ЭтотОбъект.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецФункции




&НаСервере
Функция ОтправитьПисьмоНаСервере()
	Возврат Документы.ПриемкаСдачаВыполненныхРаботУслуг.РассылкаИсполнителю(Объект);
КонецФункции

&НаСервере
Функция ПоучитьУчетнуюЗаписьОтправителя();
	Пользователь = АльтерраОбщегоНазначения.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка,
	|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя КАК ИмяПользователя
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.ВладелецУчетнойЗаписи = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь );
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	Возврат Неопределено
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	ПечатнаяФорма = СформироватьНаСервере(Объект.Клининг);
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере(Клининг)
	Возврат Документы.ПриемкаСдачаВыполненныхРаботУслуг.СформироватьПечатнуюФорму(Объект, ЭтоСотрудник, Клининг);
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	Коллекция = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("МакетПриемкаСдача");
	ТабДокумент = СформироватьНаСервере(Объект.Клининг);
	СтруктураКоллекции = Коллекция.Получить(0);
	СтруктураКоллекции.ТабличныйДокумент = ТабДокумент ;
	УправлениеПечатьюКлиент.ПечатьДокументов(Коллекция,,ЭтаФорма);	
КонецПроцедуры

&НаКлиенте
Процедура ПодрядчикПриИзменении(Элемент)
	ПересчитатьСумму();
	СвойМассивЗначений = ОтборНоменклатурыПартнера(Объект.Подрядчик);
	Элементы.РаботыВидРабот.СписокВыбора.ЗагрузитьЗначения(СвойМассивЗначений);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		ВидимостьЭлементовТСД();
	#КонецЕсли

	Если АльтерраОбщегоНазначения._РольДоступна("ПолныеПрава") Тогда
		Элементы.НомерАкта.ТолькоПросмотр = Ложь;
	КонецЕсли;
	Элементы.РаботыВремяФакт.ТолькоПросмотр = Истина;
	Элементы.РаботыВремяФакт.Доступность = Ложь;
	Элементы.РаботыСумма.ТолькоПросмотр = Истина;
	Элементы.РаботыСумма.Доступность = Ложь;
	Элементы.РаботыЦена.ТолькоПросмотр = Истина;
	Элементы.РаботыЦена.Доступность = Ложь;
	Для Каждого строка из Объект.Работы Цикл
		Если ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			ЭтоСотрудник = Истина;
		Иначе
			ЭтоСотрудник = Ложь;
		КонецЕсли;
	КонецЦикла;
	Если ЭтоСотрудник Тогда
		Элементы.РаботыСотрудник.Видимость = Истина;
		Элементы.РаботыФИОРаботника.Видимость = Ложь;
	Иначе
		Элементы.РаботыСотрудник.Видимость = Ложь;
		Элементы.РаботыФИОРаботника.Видимость = Истина;
	КонецЕсли;
	Если Объект.ОтправленоЭП = Истина Тогда
		Элементы.Отправить1.Доступность = Ложь;
		Элементы.Отправить.Доступность = Ложь;
	КонецЕсли;
	
	Если Элементы.Отправить1.Доступность = Ложь ИЛИ Элементы.Отправить.Доступность = Ложь Тогда
		ЗаблокироватьРедактирование()
	КонецЕсли;	
	
	СтруктураКлининг();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Элементы.Клининг.Доступность = Ложь;
	КонецЕсли
КонецПроцедуры
&НаКлиенте
Процедура РаботыДатаИВремяОкончанияРаботПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаИВремяНачалаРабот) И ЗначениеЗаполнено(ТекущаяСтрока.ДатаРабот) Тогда
		ТекущаяСтрока.ВремяФакт = (ТекущаяСтрока.ДатаИВремяОкончанияРабот - ТекущаяСтрока.ДатаИВремяНачалаРабот)/3600;
		ПересчитатьСумму();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаботыДатаИВремяНачалаРаботПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаИВремяОкончанияРабот) И ЗначениеЗаполнено(ТекущаяСтрока.ДатаРабот) Тогда
		ТекущаяСтрока.ВремяФакт = (ТекущаяСтрока.ДатаИВремяОкончанияРабот - ТекущаяСтрока.ДатаИВремяНачалаРабот)/3600;
		ПересчитатьСумму();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаботыВидРаботПриИзменении(Элемент)
	ВидРабот = Элементы.Работы.ТекущиеДанные.ВидРабот;
	ДоступныйВидРабот(ВидРабот);
	ПересчитатьСумму();
КонецПроцедуры

&НаСервере
Процедура ДоступныйВидРабот(ВидРабот)
	Сотрудник = АльтерраОбщегоНазначения.ПолучитьСотрудника(Объект.Заказчик);
	РазрешенВыбор = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Отделы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Отделы КАК Отделы
	|ГДЕ
	|	Отделы.Наименование Подобно ""Отдел транспортной логистики""";
	Партнер = Справочники.Партнеры.НайтиПоКоду("0А-А0061152");
	Партнер2 = Справочники.Партнеры.НайтиПоКоду("0А-00015887");  
	Если ВидРабот = Справочники.НоменклатураКонтрагентов.НайтиПоКоду("01-00000002", , ,Партнер)
		ИЛИ  ВидРабот = Справочники.НоменклатураКонтрагентов.НайтиПоКоду("01-00000003", , ,Партнер2) Тогда
		РазрешенВыбор = Ложь;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Сотрудник.Отдел = Выборка.Ссылка Тогда
				РазрешенВыбор = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
//	Если НЕ РазрешенВыбор Тогда
//		МассивСтрок = Объект.Работы.НайтиСтроки(Новый Структура ("ВидРабот", ВидРабот));
//		Для Каждого Строка из МассивСтрок Цикл
//			Строка.ВидРабот = Справочники.НоменклатураКонтрагентов.ПустаяСсылка();
//		КонецЦикла;
//		ТексСообщения = "Использование данного вида работ доступно только для Отдела транспортной логистики";
//		ОбщегоНазначения.СообщитьПользователю(ТексСообщения);
//	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму();
	Если ЗначениеЗаполнено(Объект.Подрядчик) Тогда
		ПроцентПодрядчика = ПолучитьПроцентПодрядчика(Объект.Подрядчик);
	КонецЕсли;
	Для каждого Строка из объект.Работы Цикл
		Если ЗначениеЗаполнено(Строка.ВремяФакт) 
			И ЗначениеЗаполнено(Строка.ВидРабот) Тогда
			ЦенаРаботы = ПересчитатьСуммуНаСервере(Строка.ВидРабот);
			Если ЦенаРаботы <> Неопределено Тогда
				Строка.Цена = ЦенаРаботы;
				Строка.ОплатаПодрядчику = ЦенаРаботы * Строка.ВремяФакт;
				Если ПроцентПодрядчика <> Неопределено Тогда
					Строка.Сумма = (Строка.ОплатаПодрядчику *(ПроцентПодрядчика/100)) + Строка.ОплатаПодрядчику;
				КонецЕсли;
			Иначе
				Строка.Сумма = 0;
				Строка.Цена = 0;
				Строка.ОплатаПодрядчику = 0;
			КонецЕсли;
		Иначе
			Строка.Сумма = 0;
			Строка.Цена = 0;
			Строка.ОплатаПодрядчику = 0;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьПроцентПодрядчика(Партнер)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ДополнительныеСведения.Объект = Контрагенты.Партнер)
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &Свойство
	|	И Контрагенты.Ссылка = &Партнер";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ПроцентАутсорс");
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Значение;			
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция ПересчитатьСуммуНаСервере(ВидРабот)
	Возврат Документы.ПриемкаСдачаВыполненныхРаботУслуг.ОпределениеЦеныРабот(Объект.Подрядчик, ВидРабот, Объект.Подразделение);
КонецФункции


&НаКлиенте
Процедура СохранитьExcel(Команда)
	ТабДокумент = СформироватьНаСервере(Объект.Клининг);  
    ИмяФайла = ПолучитьИмяФайлаДляСохранения();
    Если ИмяФайла = "" Тогда
        Возврат;
    КонецЕсли; 
    Попытка
        ТабДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
        Сообщить("Документ сохранен в файл: " + ИмяФайла);
    Исключение
        Сообщить("Ошибка при сохранении: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьИмяФайлаДляСохранения()
    ДиалогСохранения = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
    ДиалогСохранения.Фильтр = "Файлы Excel (*.xlsx)|*.xlsx";
    ДиалогСохранения.ПолноеИмяФайла = "Акт" + Объект.Номер + ".xlsx";
    Если ДиалогСохранения.Выбрать() Тогда
        Возврат ДиалогСохранения.ПолноеИмяФайла;
    Иначе
        Возврат "";
    КонецЕсли;
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьИДоступность(ИмяЭлемента, Видимость, Доступность)
	Элементы[ИмяЭлемента].Видимость = Видимость;
	Элементы[ИмяЭлемента].Доступность = Доступность;
КонецПроцедуры

&НаКлиенте
Процедура КлинингПриИзменении(Элемент)
	
	СтруктураКлининг()
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураКлининг()

	МассивОбычныхРабот = Новый Массив;
	МассивОбычныхРабот.Добавить("ВыполненныеРаботы");
	МассивОбычныхРабот.Добавить("ПланСотрудники");
	МассивОбычныхРабот.Добавить("ЭтоСотрудник");
	МассивОбычныхРабот.Добавить("РаботыФИОРаботника");
	МассивОбычныхРабот.Добавить("РаботыДатаИВремяНачалаРабот");
	МассивОбычныхРабот.Добавить("РаботыДатаИВремяОкончанияРабот");
	МассивОбычныхРабот.Добавить("РаботыВремяФакт");
	МассивОбычныхРабот.Добавить("РаботыЦена");
	МассивОбычныхРабот.Добавить("РаботыОплатаПодрядчику");
	МассивОбычныхРабот.Добавить("РаботыНомерТелефона");
	МассивОбычныхРабот.Добавить("РаботыБанк");
	МассивОбычныхРабот.Добавить("РаботыКомментарийККачествуВыполненияРабот");
	
	МассивКлинингРабот = Новый Массив;
	МассивКлинингРабот.Добавить("РаботыКлинингПлощадь");
	МассивКлинингРабот.Добавить("РаботыКлинингВыполненныеРаботы");
	МассивКлинингРабот.Добавить("РаботыКлинингОценкаКачества");
	МассивКлинингРабот.Добавить("РаботыКлинингТариф");
	
	Если Объект.Клининг Тогда
		Для Каждого ИмяЭлемента Из МассивОбычныхРабот Цикл
			УстановитьВидимостьИДоступность(ИмяЭлемента, Ложь, Ложь);
		КонецЦикла;
		
		Для Каждого ИмяЭлемента Из МассивКлинингРабот Цикл
			УстановитьВидимостьИДоступность(ИмяЭлемента, Истина, Истина);
		КонецЦикла;
	Иначе
		Для Каждого ИмяЭлемента Из МассивОбычныхРабот Цикл
			УстановитьВидимостьИДоступность(ИмяЭлемента, Истина, Истина);
		КонецЦикла;
		
		Для Каждого ИмяЭлемента Из МассивКлинингРабот Цикл
			УстановитьВидимостьИДоступность(ИмяЭлемента, Ложь, Ложь);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура РаботыКлинингПлощадьПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	Площадь = ТекущиеДанные.КлинингПлощадь;
	
	Подрядчик = Объект.Подрядчик;
	ВидРабот = ТекущиеДанные.ВидРабот;
	Подразделение = Объект.Подразделение;
	
	Если Подрядчик = Неопределено ИЛИ Подрядчик = "" Тогда
		Сообщить("Не заполнен реквизит Подрядчик!");
		Возврат;
	КонецЕсли;
		
	Если ВидРабот = Неопределено ИЛИ ВидРабот = "" Тогда
		Сообщить("Не заполнен реквизит Вид работ!");
		Возврат;
	КонецЕсли;  
	
	Если Подразделение = Неопределено ИЛИ Подразделение = "" Тогда
		Сообщить("Не заполнен реквизит Подразделение!");
		Возврат;
	КонецЕсли; 

	
	МассивКлининг = ПолучитьТариф(Площадь, Подрядчик, Подразделение, ВидРабот);
	
	Если МассивКлининг = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ТекущиеДанные.Сумма = МассивКлининг[0] * Площадь; 
	
	Если ТекущиеДанные.Сумма <> 0 Тогда
		ТекущиеДанные.КлинингТариф = МассивКлининг[1];
	ИначеЕсли ТекущиеДанные.Сумма = 0 Тогда
		ТекущиеДанные.КлинингПлощадь = 0;
    КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТариф(Площадь, Подрядчик, Подразделение, ВидРабот)
	
	Тариф = Новый массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтоимостьТарифовКлининг.СтоимостьТарифаКлининг КАК Стоимость,
	|	СтоимостьТарифовКлининг.ТарифКлининг КАК ТарифКлининг,
	|	СтоимостьТарифовКлининг.ВладелецТарифаКлининг КАК ВладелецТарифаКлининг
	|ИЗ
	|	РегистрСведений.СтоимостьТарифовКлининг КАК СтоимостьТарифовКлининг
	|ГДЕ
	|	СтоимостьТарифовКлининг.ДиапозонОт < &Площадь
	|	И (СтоимостьТарифовКлининг.ДиапозонДо > &Площадь ИЛИ СтоимостьТарифовКлининг.ДиапозонДо = &Площадь) 
	|	И СтоимостьТарифовКлининг.ВладелецТарифаКлининг = &Подрядчик
	|   И СтоимостьТарифовКлининг.Подразделение = &Подразделение
	|   И СтоимостьТарифовКлининг.ВидУборки = &ВидРабот";

	Запрос.УстановитьПараметр("Площадь", Площадь);
	Запрос.УстановитьПараметр("Подрядчик", Подрядчик);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ВидРабот", ВидРабот);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Сообщить("Тариф не найден. Проверьте регистр тарифов");
		Возврат Неопределено
	КонецЕсли;
	
	Тариф.Добавить(РезультатЗапроса[0].Стоимость);
	Тариф.Добавить(РезультатЗапроса[0].ТарифКлининг);
	
	Возврат Тариф;
КонецФункции

&НаКлиенте
Процедура РаботыКлинингОценкаКачестваПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	Оценка =  ТекущиеДанные.КлинингОценкаКачества;
	
	Если Оценка < 1 ИЛИ Оценка > 5 Тогда
		ТекущиеДанные.КлинингОценкаКачества = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Элементы.Отправить.Доступность Тогда
		Ответ = Вопрос(Нстр("ru = 'Письмо не отправлено, закрыть документ?'"), 
                   РежимДиалогаВопрос.ДаНет, 0);
				   
		Если Ответ <> КодВозвратаДиалога.Да Тогда
       		Элементы.Отправить.ЦветФона = Новый Цвет(255,0,0);
        	Отказ = Истина;
    	КонецЕсли;
	КонецЕсли;	
КонецПроцедуры 

Функция СотрудникИзСлужбыПерсонала()
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ГруппыДоступаПользователи.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		|		ПО (ГруппыДоступаПользователи.Ссылка = ГруппыДоступа.Ссылка)
		|ГДЕ
		|	ГруппыДоступа.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Справочники.ГруппыДоступа.НайтиПоНаименованию("Служба персонала (общие отдела)"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	СлужбаПерсонала = ВыборкаДетальныеЗаписи[0];
	
	Для каждого Сотрудник из СлужбаПерсонала.Пользователь.Состав Цикл
		Если Сотрудник.Пользователь = Пользователи.ТекущийПользователь() Тогда
			ЭтотОбъект.ТолькоПросмотр = Ложь;
			Результат = Истина;
			Прервать
		КонецЕсли;
    КонецЦикла;
		
    Возврат Результат;
КонецФункции;
